{"class_name": "Model", "keras_version": "2.1.4", "backend": "tensorflow", "config": {"name": "model_3", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"name": "input_2", "dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 4]}, "inbound_nodes": []}, {"name": "input_3", "class_name": "InputLayer", "config": {"name": "input_3", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 600]}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"name": "input_4", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 600]}, "inbound_nodes": []}, {"name": "lstm_2", "class_name": "LSTM", "config": {"recurrent_constraint": null, "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 600, "name": "lstm_2", "return_state": true, "recurrent_dropout": 0.0, "bias_constraint": null, "activation": "tanh", "unroll": false, "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "implementation": 1, "unit_forget_bias": true}, "inbound_nodes": [[["input_2", 0, 0, {}], ["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_regularizer": null, "units": 4, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0], ["lstm_2", 0, 1], ["lstm_2", 0, 2]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]]}}