{"config": {"output_layers": [["dense_1", 0, 0], ["lstm_2", 0, 1], ["lstm_2", 0, 2]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, 4], "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 800], "name": "input_3"}, "inbound_nodes": [], "name": "input_3", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 800], "name": "input_4"}, "inbound_nodes": [], "name": "input_4", "class_name": "InputLayer"}, {"config": {"activation": "tanh", "return_state": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_2", "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "implementation": 1, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "bias_regularizer": null, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 800}, "inbound_nodes": [[["input_2", 0, 0, {}], ["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]], "name": "lstm_2", "class_name": "LSTM"}, {"config": {"activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 4}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}], "name": "model_3"}, "backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Model"}