{"config": {"output_layers": [["concatenate_1", 0, 0], ["concatenate_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null], "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"input_length": 20, "embeddings_constraint": null, "trainable": false, "activity_regularizer": null, "input_dim": 40000, "name": "embedding_1", "output_dim": 200, "dtype": "float32", "batch_input_shape": [null, 20], "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"layer": {"config": {"activation": "tanh", "return_state": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "implementation": 1, "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "bias_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 400}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_1", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "bidirectional_1", "class_name": "Bidirectional"}, {"config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 1, {}], ["bidirectional_1", 0, 3, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}, {"config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 2, {}], ["bidirectional_1", 0, 4, {}]]], "name": "concatenate_2", "class_name": "Concatenate"}], "name": "model_2"}, "backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Model"}