{"class_name": "Model", "keras_version": "2.1.4", "backend": "tensorflow", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, null]}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"embeddings_regularizer": null, "dtype": "float32", "mask_zero": false, "trainable": false, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_dim": 20000, "activity_regularizer": null, "batch_input_shape": [null, 20], "input_length": 20, "embeddings_constraint": null, "output_dim": 200}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_constraint": null, "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 300, "name": "lstm_1", "return_state": true, "recurrent_dropout": 0.0, "bias_constraint": null, "activation": "tanh", "unroll": false, "bias_regularizer": null, "return_sequences": false, "dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "implementation": 1, "unit_forget_bias": true}}, "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 1, {}], ["bidirectional_1", 0, 3, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 2, {}], ["bidirectional_1", 0, 4, {}]]]}], "output_layers": [["concatenate_1", 0, 0], ["concatenate_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}