{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "sparse": false, "dtype": "float32", "name": "input_2"}, "inbound_nodes": []}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 800], "sparse": false, "dtype": "float32", "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 800], "sparse": false, "dtype": "float32", "name": "input_4"}, "inbound_nodes": []}, {"name": "lstm_2", "class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_sequences": true, "units": 800, "return_state": true, "bias_constraint": null, "unroll": false, "trainable": true, "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_2", "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "kernel_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}], ["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 4, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0], ["lstm_2", 0, 1], ["lstm_2", 0, 2]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.4"}