{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "batch_input_shape": [null, 20], "input_dim": 40000, "embeddings_constraint": null, "trainable": false, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 20, "embeddings_regularizer": null, "output_dim": 300}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_sequences": false, "units": 400, "return_state": true, "bias_constraint": null, "unroll": false, "trainable": true, "go_backwards": false, "kernel_constraint": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_1", "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "activity_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "kernel_regularizer": null}}}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 1, {}], ["bidirectional_1", 0, 3, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": -1, "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 2, {}], ["bidirectional_1", 0, 4, {}]]]}], "output_layers": [["concatenate_1", 0, 0], ["concatenate_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.4"}